<a href="https://colab.research.google.com/github/tgallach/8-23-19/blob/master/Names_Data_Gallacher.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
PATH = "http://optimizizer.com/data/"
names = pd.read_csv(PATH + 'names.csv', sep=',')
names.head()

       name sex  births  year
0  Fletcher   M      25  1880
1      Omer   M      29  1880
2   Ulysses   M      29  1880
3     Artie   F      29  1880
4      Elza   M      25  1880

In [0]:
names.columns

Index(['name', 'sex', 'births', 'year'], dtype='object')

In [0]:
#I want to find how many babies shared my son and daughter's name during their birth year

#My Son's name is Roland, born in 2015

#My Daughter's name is Ainslee, born in 2017

In [0]:
names[ ((names.name=="Roland") & (names.year==2015)) | ((names.name=="Ainslee") & (names.year==2017)) ]

            name sex  births  year
1835658   Roland   M     471  2015
1900849  Ainslee   F      89  2017